# How to get a Frequency Table (count) of a Categorical Variable using pandas ?

In [1]:
import numpy as np
import pandas as pd
mtcars = pd.read_csv('mtcars.csv')
diamonds = pd.read_csv("diamonds.csv")

In [22]:
df = pd.read_csv("D:/Github/datasets/Sample - Superstore.csv")
req_columns = ["Category", "Sub-Category","Segment"]
df = df[req_columns]
df.head(7)

          Category Sub-Category    Segment
0        Furniture    Bookcases   Consumer
1        Furniture       Chairs   Consumer
2  Office Supplies       Labels  Corporate
3        Furniture       Tables   Consumer
4  Office Supplies      Storage   Consumer
5        Furniture  Furnishings   Consumer
6  Office Supplies          Art   Consumer

In [2]:
https://data.world/annjackson/2019-superstore

In [ ]:
mpg Miles/(US) gallon
cyl Number of cylinders
dispDisplacement (cu.in.)
hp Gross horsepower
drat Rear axle ratio
wt Weight (1000 lbs)
qsec	 1/4 mile time
vs	 Engine (0 = V-shaped, 1 = straight)
am	 Transmission (0 = automatic, 1 = manual)
gear	 Number of forward gears
carb	 Number of carburetors

In [6]:
mtcars.shape

(32, 12)

In [4]:
mtcars.head()

,cars,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [11]:
mtcars.gear.value_counts().reset_index()

   index  gear
0      3    15
1      4    12
2      5     5

In [8]:
mtcars.groupby("gear").size().reset_index(name="num_gears")

   gear  num_gears
0     3         15
1     4         12
2     5          5

In [13]:
mtcars.groupby(["cyl","am"]).size().reset_index(name="num_gears")

   cyl  am  num_gears
0    4   0          3
1    4   1          8
2    6   0          4
3    6   1          3
4    8   0         12
5    8   1          2

In [8]:
am_count = mtcars.am.value_counts().reset_index()
am_count.columns = ["am", 'count'] 
am_count

   am  count
0   0     19
1   1     13

In [16]:
am_gear_group = mtcars.groupby(["am", "gear"])
am_gear_group.size()

am  gear
0   3       15
    4        4
1   4        8
    5        5
dtype: int64

In [24]:
mtcars.groupby(["am", "gear"]).size().reset_index().rename(columns={0:"count"})

   am  gear  count
0   0     3     15
1   0     4      4
2   1     4      8
3   1     5      5

In [33]:
mtcars.groupby(["am", "gear"])\
.size()\
.reset_index()\
.rename(columns={0:"count"})

   am  gear  count
0   0     3     15
1   0     4      4
2   1     4      8
3   1     5      5

In [40]:
mtcars.groupby(["am"]).agg({"am":"count"})

    am
am
0   19
1   13

In [11]:
diamonds.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [9]:
diamonds.color.

In [10]:
diamonds = pd.read_csv("diamonds.csv")

In [11]:
diamonds.shape

(53940, 10)

In [12]:
diamonds.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [15]:
cut_count = diamonds["cut"].value_counts()
cut_count

Ideal        21551
Premium      13791
Very Good    12082
Good          4906
Fair          1610
Name: cut, dtype: int64

In [16]:
type(cut_count)

pandas.core.series.Series

In [20]:
cut_count.reset_index()

       index    cut
0      Ideal  21551
1    Premium  13791
2  Very Good  12082
3       Good   4906
4       Fair   1610

In [21]:
diamonds.color.value_counts()

G    11292
E     9797
F     9542
H     8304
D     6775
I     5422
J     2808
Name: color, dtype: int64

In [23]:
diamonds.clarity.value_counts()

SI1     13065
VS2     12258
SI2      9194
VS1      8171
VVS2     5066
VVS1     3655
IF       1790
I1        741
Name: clarity, dtype: int64

In [25]:
diamonds.clarity.size()

TypeError: 'int' object is not callable